lib/tasks/dev.rake

SELECT  "mining_types".* FROM "mining_types" WHERE "mining_types"."acronym" = ? LIMIT ?  [["acronym", "PoW"], ["LIMIT", 1]]
SELECT "mining_types".* FROM "mining_types"
---
      task add_coins: :environment do
          show_spinner("ADD COINS ....") do
          coins = [
           {
              description: "Bitcoin",
              acronym: "BTC",
              url_image: "https://cdn-icons-png.flaticon.com/512/1490/1490849.png",
              mining_type: MiningType.find_by(acronym: 'PoW'),
              active: '1'
           },
           {
              description: "Etherum",
              acronym: "ETH",
              url_image: "https://cdn-icons-png.flaticon.com/512/2089/2089411.png",
              mining_type: MiningType.all.sample,
              active: '1'
           },
           {
              description: "Dash",
              acronym: "DASH",
              url_image: "https://cdn-icons-png.flaticon.com/512/825/825534.png",
              mining_type: MiningType.all.sample,
              active: '1'
           },
           {
               description: "Iota",
               acronym: "IOT",
               url_image: "https://cryptologos.cc/logos/iota-miota-logo.png",
               mining_type: MiningType.all.sample,
               active: '1'
           },
           {
               description: "ZCash",
               acronym: "ZEC",
               url_image: "https://cdn-icons-png.flaticon.com/512/4484/4484821.png",
               mining_type: MiningType.all.sample,
               active: '0'

INSERT INTO "coins" ("description", "acronym", "url_image", "created_at", "updated_at", "mining_type_id", "active") VALUES (?, ?, ?, ?, ?, ?, ?)
---
          ]

          coins.each do |coin|
              Coin.find_or_create_by!(coin)

INSERT INTO "mining_types" ("description", "acronym", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Proof of Work"], ["acronym", "PoW"], ["created_at", "2021-11-17 00:28:42.404465"], ["updated_at", "2021-11-17 00:28:42.404465"]]
---
      task add_mining_types: :environment do
        show_spinner("ADD MINING TYPES ....") do
        mining_types = [
          {
            description: "Proof of Work",
            acronym: "PoW"
          },
          {
            description: "Proof of Stake",
            acronym: "PoS"
          },
          {
            description: "Proof of Capacity",
            acronym: "Poc"
          }
          ]
          mining_types.each do |mining_type|
              MiningType.find_or_create_by!(mining_type)