app/controllers/coins_controller.rb

  def index
    @coins = Coin.all
---
SELECT  "coins".* FROM "coins" ORDER BY "coins"."id" ASC LIMIT ?  [["LIMIT", 1]]

  def create
    @coin = Coin.new(coin_params)

    respond_to do |format|
      if @coin.save
---
INSERT INTO "coins" ("description", "acronym", "url_image", "created_at", "updated_at", "mining_type_id") VALUES (?, ?, ?, ?, ?, ?)  [["description", ""], ["acronym", ""], ["url_image", ""], ["created_at", "2021-11-06 18:54:11.492327"], ["updated_at", "2021-11-06 18:54:11.492327"], ["mining_type_id", 1]]

  def update
    respond_to do |format|
      if @coin.update(coin_params)
---
UPDATE "coins" SET "url_image" = ?, "updated_at" = ? WHERE "coins"."id" = ?  [["url_image", "https://cdn-icons-png.flaticon.com/512/2089/2089411.png"], ["updated_at", "2021-11-14 15:50:00.577068"], ["id", 6]]

  def destroy
    @coin.destroy
---
DELETE FROM "coins" WHERE "coins"."id" = ?  [["id", 6]]

    def set_mining_type_options
      @mining_type_options = MiningType.all.pluck(:description, :id)
---
SELECT "mining_types"."description", "mining_types"."id" FROM "mining_types"

    def set_coin
      @coin = Coin.find(params[:id])
---
SELECT  "coins".* FROM "coins" WHERE "coins"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]